razdel = '🌀━━━━━━━━━━━━━━━━━🌀'
#\n {razdel} \n
#Приветствие для пользователя
start_message0 = f'Твої права у боті "Користувач"\n\n' \
                 f'Даний бот для розсилки поста по каналах та чатах\n\n' \
                 f'Якщо захочеш ознайомитися з ботом, натисни Інфо \n\n' \
                 f'Якщо потрібна допомога вибери пункт Допомога\n\n' \
                 f'Щоб купити Рекламу натисни Замовити Рекламу\n'\
                 f'Щоб купити Хостінг натисни Замовити Хостінг\n'\

#Start Админу
start_message = f'Головне меню Администратора\n\n'\
                f'Натисни меню Керування функціями\n\n'\
                f'Написать старт для Админа\n\n'\

#Start Модеру
start_message2 = f'Написать старт для модератора'

#INFO Для всех
start_message3 = f'ℹ️Якщо вам потрібна допомога, ви завжди можете написати нам на тех.підтримку @moderation_ua ми швидко вам допоможемо. ' \
                 f'\n {razdel} \n' \
                 f'Про нас — ФОП Шведов Богдан \n' \
                 f'Адреса офісу\n' \
                 f'м. Черкаси, вул. сержанта Волкова 25/47\n' \
                 f'ЄДРПОУ 3568701178.' \
                 f'\n {razdel} \n' \
                 f'🗓Графік постів - Дізнатись графік публікацій постів ' \
                 f'\n {razdel} \n' \
                 f'@syrma_system - тут ми пишемо про оновлення проекту, викладаємо корисні матеріали, промокоди та кейси.' \
                 f'\n {razdel} \n' \
                 f' https://t.me/+wM8q6MpVKHg5MDAy — чат, в якому ви можете поставити запитання або обговорити.' \
                 f'\n {razdel} \n' \
                 f' Переглянути Політику конфіденційності можна за посиланням\n'\
                 f' https://t.me/syrma_system/1026.\n' \
                 f' Переглянути Договір оферти можна за посиланням\n' \
                 f' https://t.me/syrma_system/1027.'

#/info /partners /shop /grafic

#HELP Админу
start_message4 = f'🛠Усі команди для налаштування публікації👇\n' \
                 f'📌Інструкція до меню\n{razdel}\n' \
                 f'⏱Увімк. авто-пуб — Включити публікацію постів за розкладом\n{razdel}\n' \
                 f'🚫Вик авто-пуб — Вимкнути публікацію за розкладом\n{razdel}\n' \
                 f'💎Магазин — Вся інформація з оплати послуг та вартості тарифів\n{razdel}\n' \
                 f'🎁Реф-посилання — Запросити друга та отримати знижку на використання бота\n{razdel}\n' \
                 f'🗓Графік розсилки — Дні тижня та час публікації постів.\n{razdel}\n' \
                 f'📚FAQ — \n{razdel}\n' \
                 f'📝Заголовок поста - Шапка рекламного поста\n{razdel}\n' \
                 f'📝Середина посту - Основна частина рекламного посту\n{razdel}\n' \
                 f'📝Низ посту — Нижня частина рекламного посту\n{razdel}\n' \
                 f'➕Додати канал — Можна додати кілька каналів відразу\n{razdel}\n' \
                 f'🗑Видалити канали — Видалити всі канали\n{razdel}\n' \
                 f'🗑Видалити 1 канал — Видалити 1 Канал зі списку\n{razdel}\n' \
                 f'👤Додати адміна — Для додавання адміністратора потрібно, щоб він 1 раз запустив бота і знати його ID \n{razdel}\n' \
                 f'👥Список адмінів — Список усіх адміністраторів\n' \
                 f'🚷Видалити адміна — Для видалення адміністратора потрібно, щоб він 1 раз запустив бота і знати його ID, а потім ввести /del -id usera\n{razdel}\n' \
                 f'📢Надіслати пост — Надіслати пост прям зараз, але після цього ввімкнуться автопублікація постів\n{razdel}\n' \
                 f'🗑Видалити пости — Видалити всі пости, які пам*ятає бот\n{razdel}\n' \
                 f'💌Показати пост — Показати готовий пост у роботі\n{razdel}\n' \
                 f'📃Список каналів — Покаже канали, в яких публікують пости\n{razdel}\n' \
                 f'📷Посилання на медіа — Щоб отримати посилання на медіа, використовуй обліковий запис на ресурсі imgur.com\n{razdel}\n' \
                 f'🔨Тип розсилки (з медіа/без медіа) —  \n'

#HELP Модеру
start_message5 = f'➕Додати канал — Можна додати кілька каналів відразу\n🗑Видалити канали — Видалити всі канали\n' \
                 f'При створенні посту ти створиш лише свій і не зможеш редагувати пости інших модераторів чи адмінів\n'
#HELP Для обычного юзера инструкция
start_message6 = f'Якщо тобі потрібна реклама твого каналу у списку\n' \
                 f'Перейди по кнопці 👉🏻Замовити рекламу\n' \
                 f'👉🏻АБО Ж👇🏻\n' \
                 f'Якщо ти хочеш собі такого ж бота та самим надавати рекламні послуги\n' \
                 f'напиши мені👉🏻 @moderation_ua\n' \

#Новости
start_message7 = f'Слідкуйте за новинами робота в каналі @syrma_system\n' \
                 f'\n' \
                 f'Зараз ми додаємо можливість швидкої покупки реклами одразу через бота'
#Вибір тарифу
start_message8 = f'В цьому меню ти зможешь вибрати тариф який тобі більше потрібен\n\n' \
                 f'Щоб повернутися у головне меню натисни Назад\n' \

#Партнеры/партнерство 🎁Реферальная ссылка У розробці
start_message9 = f'🎁Реферальне посилання у розробці, запрошення на посилання друга щоб отримати знижку на рекламу свого каналу'
#Магазин
start_message10= f'🏧Тарифи 💎 SHOP\n {razdel}\n🏧Тарифи на Рекламу \n1 місяць - 100 гривень\n3 місяця - 500 гривень\n6 місяців - 1000 гривень\n12 місяців - 1500 гривень\n\n'\
                 f'🏧Тарифи на Хостинг \n1 місяць - 390 гривень\n3 місяця - 700 гривень\n6 місяців - 1200 гривень\n12 місяців - 1800 гривень\n' \
                 f'Також є можливість брати участь у проекті без публікації рекламного посту на твоєму каналі за додаткову плату.\n Необхідно доплатити 150 гривень\n \n Ціни актуальні до 31 серпня 2025 року!\n {razdel} \n' \
                 f'1. Надішліть нам назву свого каналу або чату, яка відображатиметься в загальному списку👇\n @moderation_ua\n2. Вкажи дію посилання на канал/чат \n3. Додай до адмінки свого каналу бота \n' \
                 f'4. Видай боту такі права:\n 📃Публікація повідомлень,\n 📃Редагування повідомлень,\n 📃Видалення повідомлень.\n5. Оплати участь згідно з обраним тобою тарифом.\n\nВаріанти оплати:\n- На карту 4441 1144 5650 4065\n- Переказ на гаманець PAYPAL 👇\nshvedov.bogdan@hotmail.com\n\n TONcoin рахунок👇\n UQAA5g1Z-5ECICeSx_E-skawzsZnrO_Sg2tTjvrJ7IsLxma3\n{razdel}'


#График рассылки
start_message11= f'Графік розсилки публікацій\n' \
                 f'❤У Понеділок з 10:00 з видаленням о 22:00 ♻\n' \
                 f'🧡У Вівторок з 10:00 з видаленням о 22:00 ♻\n' \
                 f'💛У Середу з 10:00 з видаленням о 22:00 ♻\n' \
                 f'💚У Четвер з 10:00 з видаленням о 22:00 ♻\n' \
                 f'💙У П ятницю з 10:00 з видаленням о 22:00 ♻\n' \
                 f'💜У Суботу з 10:00 з видаленням о 22:00  ♻\n' \
                 f'💜У Неділю з 14:00 з видаленням о 22:00 ♻\n'

#Поверненя у головне меню
start_message12= f'Ти знову у головному меню\n\n' \
                 f'Твої права у боті "Користувач"\n\n' \
                 f'Даний бот для розсилки поста по каналах та чатах\n\n' \
                 f'Якщо захочеш ознайомитися з ботом, натисни Інфо \n\n' \
                 f'Якщо потрібна допомога вибери пункт Допомога\n\n' \
                 f'Щоб купити Рекламу натисни Замовити Рекламу\n'\
                 f'Щоб купити Хостінг натисни Замовити Хостинг\n'\

start_message13= f'Ти у Керуваннях функціями\n\n' \
                 f'Тут вже повний функціонал бота\n' \
                 f'Тут ти зможешь Увімкнути або Вимкнути автопостінг у канали\n' \
                 f'Також тут можна додати нові канали та групи або Видалити\n' \
                 f'Ще є функція додавання Модераторів у бот\n' \


start_message14= f'Ти у знову в головному меню\n\n' \

#Оновлено в Квітні 30,07,2024